Revit 2025 API
StairsPathLineShapeAtCorner Enumeration
 The options for the line shape of a stairs path at a corner.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StairsPathLineShapeAtCorner
Public Enumeration StairsPathLineShapeAtCorner
public enum class StairsPathLineShapeAtCorner
type StairsPathLineShapeAtCorner
Members
Member name | Value | Description
Straight | 0 |  The line shape of stairs path at the corner is straight.
Curved | 1 |  The line shape of stairs path at the corner is curved.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace